[
    {
        "img": [
            "covid-tracker.PNG",
            "covid-tracker2.PNG"
        ],
        "alt": "Covid-19 Tracker screenshots",
        "name": "Covid-19 Tracker",
        "github": "https://github.com/abir-chakroun/Covid-19-Tracker",
        "link": "https://covid-19-tracker-5fd3e.web.app/",
        "description": "A platform for COVID-19 live data visualizations. It is a frontend application build in React, utilizing MaterialUI.",
        "keywords": "Keywords: ReactJs, React hooks, Leaflet, Chart.js"
    },
    {
        "img": [
            "netflix-clone.PNG",
            "netflix-clone2.PNG"
        ],
        "alt": "Netflix clone screenshots",
        "name": "Netflix clone",
        "link": "https://netflixclone-ff690.web.app/",
        "github": "https://github.com/abir-chakroun/NetflixClone",
        "description": "A netflix clone allowing users to discover a wide range of movies and display trailers. This project helped me improve my skills in advanced React concepts. In fact, I learned how to properly manipulate React hooks and improved my styling skills. I also used Eslint and Prettier to make sure that the code is clean and maintanable.",
        "keywords": "Keywords: ReactJs, React hooks"
    },
    {
        "img": [
            "ydoozy_1.PNG",
            "ydoozy_2.PNG",
            "ydoozy_3.PNG",
            "ydoozy_4.PNG",
            "ydoozy_5.PNG",
            "ydoozy_6.PNG"
        ],
        "alt": "Ydoozy screenshots",
        "name": "Ydoozy:  Online Courses search engine",
        "description": "It is an e-learning management platform with a progress tracking dashboard for Career Boosting. My work included the database and architecture design and implementation of the fullstack application from scratch following a given UI/UX design. This application's services are dedicated to 2 types of users according to their level of access to the app: learners to manage their training and track their progress and administrators to manage users, courses and careers.",
        "keywords": "Keywords: ReactJS, Postman, Git, Node JS (Express JS, Mongoose), MongoDb, MongoDb Atlas, Heroku"
    }
]